## 1. CREATE

``` SQL
CREATE TABLE cars (
    id          SMALLINT,           
    brand       VARCHAR(20),        
    price       NUMERIC,            
    fuel_type   TEXT,               
    mileage     NUMERIC,
    is_new      BOOLEAN,            
    prod_date   DATE                
);
```

## 2. INSERT

``` SQL
INSERT INTO cars (
id, brand, price, fuel_type, mileage, is_new, prod_date
)
VALUES (
1, 'Audi', 80000, 'Benzyna', 200000, True, '2015-09-12'
);

```

## 3. SELECT

``` SQL
SELECT * FROM cars
WHERE price > 50000
ORDER BY mileage; 
```

## 4. UPDATE

``` SQL
UPDATE cars SET (mileage, is_new) = (1000, 'False') WHERE id = 4;
```

## 5. DELETE

``` SQL
DELETE FROM cars WHERE is_new = False
```

## 6. DROP

``` SQL
DROP TABLE cars
```